app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "full_name", "num_badges", "num_points", "profile_pic_link", "updated_at", "username_link_to_profile_page") VALUES (?, ?, ?, ?, ?, ?, ?)